[
    {
        "title": "John 'Paddy' Hemingway (105) overleden, laatste held van Battle of Britain in WO II",
        "places": [
            {
                "name": "Groot-Brittannië",
                "type": "country",
                "difficulty": "Even if country name is not in Dutch (Britain in this case), you should extract it as Dutch name (Groot-Brittannië in this case)."
            }
        ]
    },
    {
        "title": "Kortrijk lanceert fietscampagne 'Velo Vibe' om inwoners aan te zetten vaker te fietsen",
        "places": [
            {
                "name": "Kortrijk",
                "type": "municipality",
                "difficulty": null
            }
        ]
    },
    {
        "title": "Voormalig burgemeester van Staden Francesco Vanderjeugd veroordeeld tot 1 jaar cel met uitstel voor verduistering en belangenvermenging  ",
        "places": [
            {
                "name": "Staden",
                "type": "municipality",
                "difficulty": null
            }
        ]
    },
    {
        "title": "'The shining' in het echt? Teamlid uit Zuid-Afrika valt collega's aan op geïsoleerde basis op Antarctica",
        "places": [
            {
                "name": "Zuid-Afrika",
                "type": "country",
                "difficulty": null
            },
            {
                "name": "Antarctica",
                "type": "region",
                "difficulty": null
            }
        ]
    },
    {
        "title": "Stad Brussel geeft taalpremie van 155 euro aan onderwijzers die Frans kunnen geven",
        "places": [
            {
                "name": "Brussel",
                "type": "municipality",
                "difficulty": null
            }
        ]
    },
    {
        "title": "\"Rusland bereidt zich voor op confrontatie met Europa\", waarschuwt Europees Commissievoorzitter Von der Leyen",
        "places": [
            {
                "name": "Rusland",
                "type": "country",
                "difficulty": null
            },
            {
                "name": "Europa",
                "type": "region",
                "difficulty": null
            }
        ]
    },
    {
        "title": "Congolese M23-rebellen nemen dan toch niet deel aan vredesgesprekken in Angola",
        "places": [
            {
                "name": "Congo",
                "type": "country",
                "difficulty": "Country in adjective form."
            },
            {
                "name": "Angola",
                "type": "country",
                "difficulty": null
            }
        ]
    },
    {
        "title": "Pommelien Thijs, Koen Wauters, Nora Gharib en meer dan 100 BV's spreken zich uit tegen Israëlisch geweld: \"België kan en moet meer doen\"",
        "places": [
            {
                "name": "Israël",
                "type": "country",
                "difficulty": "Country in adjective form."
            },
            {
                "name": "België",
                "type": "country"
            }
        ]
    },
    {
        "title": "Vlaamse regering wil meer ruimte voor windmolens en zonnepanelen op landbouwgrond",
        "places": [
            {
                "name": "Vlaanderen",
                "type": "region",
                "difficulty": "Region in adjective form."
            }
        ]
    },
    {
        "title": "Vlaamse regering wil meer ruimte voor windmolens en zonnepanelen op landbouwgrond",
        "places": [
            {
                "name": "Vlaanderen",
                "type": "region",
                "difficulty": "Region in adjective form."
            }
        ]
    },
    {
        "title": "EU komt met details herbewapeningplan: defensiemiljarden mogen buiten begrotingsdoelstellingen",
        "places": [
        ],
        "difficulty": "Name place in organisation (E for Europa in EU abbreviation) should not be considered as a place. "
    },
    {
        "title": "Bekende professor UGent in opspraak na beschuldiging van grensoverschrijdend gedrag in 2011, universiteit reageert: \"We hebben toen gefaald\"",
        "places": [],
        "difficulty": "Name place in organisation (Gent in UGent) should not be considered as a place."
    },
    {
        "title": "Europese Commissie komt met actieplan om kreunende staalsector te helpen",
        "places": [],
        "difficulty": "Name place in organisation (Europa in Europese Commissie) should not be considered as a place. "
    },
    {
        "title": "Chipszakken moeten kraken, anders zouden we chips niet lekker meer vinden ",
        "places": [],
        "difficulty": "No places mentioned in title."
    },
    {
        "title": "Brandende Cybertrucks en wagens beklad met hakenkruizen: golf\nvan vandalisme tegen Tesla",
        "places": [],
        "difficulty": "No places mentioned in title."
    },
    {
        "title": "Van reusachtig groot tot onooglijk klein: maak kennis met de hoofdrolspelers uit 'De wilde Noordzee'",
        "places": [],
        "difficulty": "Places mentioned as part of artistic works should not be extracted."
    },
    {
        "title": "Donald Trump en Vladimir Poetin bellen elkaar, hoe verloopt een gesprek tussen zulke wereldleiders?",
        "places": [],
        "difficulty": "Although both Trump and Putin represent countries, the countries aren't mentioned explicitly in the title so shouldn't be extracted."
    },
    {
        "title": "9-jarig meisje in kuit gebeten door loslopende hond in Ter Kamerenbos in Elsene",
        "places": [
            {
                "name": "Elsene",
                "type": "municipality"
            }
        ],
        "difficulty": "Ter Kamerenbos isn't a municipality, region or country so should not be extracted."
    },
    {
        "title": "Actievoerders protesteren aan Provinciehuis tegen plannen voor nieuwe verbindingsweg tussen Slijpe en centrum Middelkerke",
        "places": [
            {
                "name": "Middelkerke",
                "type": "municipality"
            },
            {
                "name": "Slijpe",
                "type": "municipality"
            }
        ],
        "difficulty": "Provinciehuis isn't a municipality, region or country so should not be extracted."
    },
    {
        "title": "Burgemeester Pieter De Crem laat niet-Belgen 9 keer langer wachten dan Belgen op domiciliëring in Aalter",
        "places": [
            {
                "name": "Aalter",
                "type": "municipality"
            },
            {
                "name": "België",
                "type": "country",
                "difficulty": "Nationality Belg refers to country België, so Belgieë should be extracted."
            }
        ]
    }
]